Repository: vrk-kpa/ckanext-organizationapproval
Catalog: ckanext/organizationapproval/i18n/*/LC_MESSAGES/ckanext-organizationapproval.po
Languages: fi

source: User not authorized to view page
fi: Käyttäjällä ei ole oikeuksia nähdä tätä sivua

source: Organization was successfully updated
fi: Organisaatio päivitettiin onnistuneesti

source: Status is already set to '%s'
fi: Status on jo asetettu tilaan '%s'

source: Status not allowed
fi: Status ei sallittu

source: Successfully sent email notification
fi: Sähköposti-ilmoitus lähetettiin onnistuneesti

source: Failed to send email notification
fi: Sähköposti-ilmoituksen lähetys epäonnistui

source: Manage Organizations
fi: Hallinnoi organisaatioita

source: Are you sure you want to permanently delete this organization?
fi: Haluatko varmasti poistaa organisaation pysyvästi?

source: Why is this organization denied? The following text will be sent to the organization maintainer:
fi: Miksi tämä organisaatio hylätään? Kirjoita alle hylkäämisen syy organisaation ylläpitäjälle:

source: eg. Organization description not allowed
fi: esim. Organisaation kuvaus ei sallittu

source: Approve
fi: Hyväksy

source: Deny
fi: Hylkää

source: Edit
fi: Muokkaa

source: Remove
fi: Poista

source: You can approve and delete organizations
fi: Voit hyväksyä ja poistaa organisaatioita

source: Organization is pending approval
fi: Organisaatio odottaa hyväksyntää

source: Organization has been denied, edit organization's details and request reapproval
fi: Organisaatiosi hylättiin. Muokkaa organisaation tietoja ja pyydä hyväksyntää uudelleen.

source: Save and request reapproval
fi: Tallenna ja lähetä uudelleenarvioitavaksi
